app/controllers/shows_controller.rb

  def index
    @shows = Show.all
---
SELECT "shows".* FROM "shows"

      @show.genre = show_data['Genre'].split('|').reject(&:empty?)
    end
    @show.last_updated = current_date
    @show.save
---
INSERT INTO "shows" ("created_at", "name", "overview", "tvdb_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-06 23:51:26.661644"], ["name", "Hello"], ["overview", "Test"], ["tvdb_id", ""], ["updated_at", "2014-12-06 23:51:26.661644"]]

  def destroy
    @show.destroy
---
DELETE FROM "shows" WHERE "shows"."id" = $1  [["id", 1]]

    def set_show
      @show = Show.find(params[:id])
---
SELECT  "shows".* FROM "shows"  WHERE "shows"."id" = $1 LIMIT 1  [["id", 1]]